{
  "DataList": [
    {
      "Name": "1-1",
      "Description": null
    },
    {
      "Name": "1-2",
      "Description": null
    },
    {
      "Name": "1-3",
      "Description": null
    },
    {
      "Name": "1-4",
      "Description": null
    },
    {
      "Name": "1-5",
      "Description": null
    },
    {
      "Name": "1-1H",
      "Description": null
    },
    {
      "Name": "1-2H",
      "Description": null
    },
    {
      "Name": "1-3H",
      "Description": null
    },
    {
      "Name": "2-1",
      "Description": null
    },
    {
      "Name": "2-2",
      "Description": null
    },
    {
      "Name": "2-3",
      "Description": null
    },
    {
      "Name": "2-4",
      "Description": null
    },
    {
      "Name": "2-5",
      "Description": null
    },
    {
      "Name": "2-1H",
      "Description": null
    },
    {
      "Name": "2-2H",
      "Description": null
    },
    {
      "Name": "2-3H",
      "Description": null
    },
    {
      "Name": "3-1",
      "Description": null
    },
    {
      "Name": "3-2",
      "Description": null
    },
    {
      "Name": "3-3",
      "Description": null
    },
    {
      "Name": "3-4",
      "Description": null
    },
    {
      "Name": "3-5",
      "Description": null
    },
    {
      "Name": "3-1H",
      "Description": null
    },
    {
      "Name": "3-2H",
      "Description": null
    },
    {
      "Name": "3-3H",
      "Description": null
    },
    {
      "Name": "4-1",
      "Description": null
    },
    {
      "Name": "4-2",
      "Description": null
    },
    {
      "Name": "4-3",
      "Description": null
    },
    {
      "Name": "4-4",
      "Description": null
    },
    {
      "Name": "4-5",
      "Description": null
    },
    {
      "Name": "4-1H",
      "Description": null
    },
    {
      "Name": "4-2H",
      "Description": null
    },
    {
      "Name": "4-3H",
      "Description": null
    },
    {
      "Name": "5-1",
      "Description": null
    },
    {
      "Name": "5-2",
      "Description": null
    },
    {
      "Name": "5-3",
      "Description": null
    },
    {
      "Name": "5-4",
      "Description": null
    },
    {
      "Name": "5-5",
      "Description": null
    },
    {
      "Name": "5-1H",
      "Description": null
    },
    {
      "Name": "5-2H",
      "Description": null
    },
    {
      "Name": "5-3H",
      "Description": null
    },
    {
      "Name": "6-1",
      "Description": null
    },
    {
      "Name": "6-2",
      "Description": null
    },
    {
      "Name": "6-3",
      "Description": null
    },
    {
      "Name": "6-4",
      "Description": null
    },
    {
      "Name": "6-5",
      "Description": null
    },
    {
      "Name": "6-1H",
      "Description": null
    },
    {
      "Name": "6-2H",
      "Description": null
    },
    {
      "Name": "6-3H",
      "Description": null
    },
    {
      "Name": "7-1",
      "Description": null
    },
    {
      "Name": "7-2",
      "Description": "Boss-killer team left, sweep team topside (2 Turns)\n\nKill enemy infront of bk team by using sweep team, swap sweep team with bk team then move to bottom teleport tile (1)\n\nMove bk team to eat ramen, end phases"
    },
    {
      "Name": "7-3",
      "Description": "Boss-killer team left, sweep team bottom side (2 Turns)\n\nTeleport sweep team to left side, swap sweep team with bk team, kill enemy in front\n\nMove sweep team back to right side, kill enemy alongside bk team\n\nLet the enemy do the work, end phases"
    },
    {
      "Name": "7-4",
      "Description": null
    },
    {
      "Name": "7-5",
      "Description": null
    },
    {
      "Name": "7-1H",
      "Description": null
    },
    {
      "Name": "7-2H",
      "Description": null
    },
    {
      "Name": "7-3H",
      "Description": null
    },
    {
      "Name": "8-1",
      "Description": null
    },
    {
      "Name": "8-2",
      "Description": "Boss-killer team right, sweep team left (4 Turns)\n\nTeleport sweep team to left side (1), kill enemy on top of bk team\n\nClear enemy using sweep team, bk team move to right corner\n\nMove sweep team to tile(2), bk team move to right\n\nClear enemy nearby sweep team, kill boss using bk team"
    },
    {
      "Name": "8-3",
      "Description": "Boss-killer team left, sweep team right (3 Turns)\n\nbk team kill enemy at bottom, sweep team move to right\n\nTeleport bk team to top side (1), swap sweep team with bk team, move sweep team to tile(2)\n\nkill enemy on the right side of bk team, kill enemy on the right side of sweep team, end phases"
    },
    {
      "Name": "8-4",
      "Description": null
    },
    {
      "Name": "8-5",
      "Description": null
    },
    {
      "Name": "8-1H",
      "Description": "Bossing team top, clearing team bottom.\n\nUse teleporter with both of your teams\n\nActivate (3) with clearing team and move to the right with your bossing team\n\nUse the teleporter again with your clearing team and move one spot below using your bossing team\n\nUse your clearing team to move in front of the boss, swap places with your bossing team then kill it for a 4-turn clear."
    },
    {
      "Name": "8-2H",
      "Description": "Bossing team to the right, clearing team to the left\n\nAttack the enemies below with both teams\n\nClearing team to the right, activating (3) while bossing team moves left\n\nActivate (4) with your clearing team then move your bossing team to the path that just opened\n\nUse the teleporter with your bossing team and kill the boss. You can use your clearing team to move to (2) and teleport in front of the present box too if you want to collect it."
    },
    {
      "Name": "8-3H",
      "Description": "Bossing team to the left, clearing team to the right\n\nMove your teams on top of the teleporter but don't use it\n\nUse your clearing team to activate the path on (3) then use the teleporter with your bossing team, swap places and attack the tank above.\n\nActivate the other path at (2) with your clearing team then move to the now opened path with your bossing team\n\nAttack the enemies with both of your teams on this turn. The boss will attack you for a 4-turn clear."
    },
    {
      "Name": "9-1",
      "Description": null
    },
    {
      "Name": "9-2",
      "Description": null
    },
    {
      "Name": "9-3",
      "Description": null
    },
    {
      "Name": "9-4",
      "Description": null
    },
    {
      "Name": "9-5",
      "Description": null
    },
    {
      "Name": "9-1H",
      "Description": "Bossing team top, clearing team bottom\n\nAttack the enemies with both of your teams\n\nAttack the enemy above your clearing team, swap places with your bossing team and move to (1)\n\nKill the boss on your next turn for a 3-turn clear"
    },
    {
      "Name": "9-2H",
      "Description": "Note: To complete the \"Acquire S-rank 5 times\" objective, you will need at least 4 turns, meaning that it cannot be completed in the same run as the \"Complete the mission within 3 turns\" challenge.\n\nBossing team top, clearing team bottom.\n\nAttack the enemy below your bossing team and move your clearing team up.\n\nUse your clearing team to attack the enemy above then move your bossing team right to (2).\n\nUse your clearing team to attack the enemy to the right. \n\nChoose your next steps based on your goal:\n\n'''A. To complete the \"Acquire S-rank 5 times\" objective (within 4 turns):''' \n\nAttack the enemy above your bossing team, then move your clearing team to (1).\n\nSwap places with your bossing team and attack the boss for a 4-turn clear.\n\n'''B. To complete the \"Complete the mission within 3 turns\" challenge:''' \n\nMove your bossing team right to (1). The boss will attack you on their turn for a 3-turn clear."
    },
    {
      "Name": "9-3H",
      "Description": "Bossing team Bottom, Clearing team top.\n\nAttack the enemy below your clearing team then swap places with your bossing team and use that team to attack the enemy now to your left.\n\nUse your clearing team to attack the enemy next to it and move your bossing team one spot down\n\nUse your clearing team to grab the giftbox above it then move your bossing team one spot left to (1). The boss will attack you for a 3-turn clear."
    },
    {
      "Name": "10-1",
      "Description": null
    },
    {
      "Name": "10-2",
      "Description": null
    },
    {
      "Name": "10-3",
      "Description": null
    },
    {
      "Name": "10-4",
      "Description": null
    },
    {
      "Name": "10-5",
      "Description": null
    },
    {
      "Name": "10-1H",
      "Description": "Bossing team to the right, Clearing team to the left\n\nAttack the enemy below you using your clearing team and then defeat the enemy next to your bossing team\n\nMove your clearing team to (2) and your bossing team to (1)\n\nAttack the enemy below you using your bossing team then make your way to the boss for a 5-turn clear. Grabbing the present box below the boss will make it a 6-turn clear\n\nYou can make a five turn, three star and present box clear if you follow the mentioned starting points above, but don't have your bossing team attack the enemy near them. \n\nMove your bossing team down to 1, attack the enemy below them. Move your clearing team to 2, then have the clearing team move back up and attack the target between the starts while having your bossing team proceed to the present box. This will allow you to attack the boss on turn 5."
    },
    {
      "Name": "10-2H",
      "Description": "Bossing team left, Clearing team right\n\nAttack the enemy below you using your clearing team then swap places with your bossing team then defeat the enemy below\n\nMove your clearing team left to (3) and move your bossing team to the path that has opened to your right\n\nMove your clearing team to (2) then Move your bossing team right again in front of the boss \n\nAttack the enemy below you using your clearing team and move your bossing team to kill the boss  for a 4-turn clear"
    },
    {
      "Name": "10-3H",
      "Description": "Bossing team right, Clearing team left\n\nAttack the enemy above your clearing team and move your bossing team left\n\nMove your clearing team to (2), swap spots with your bossing team and advance to (4) above you\n\nAttack the enemy above your bossing team and move your clearing team right\n\nMove your clearing team to (3) then move your bossing team to the new square that has appeared to the left (Grabbing the present box here will add +1 turns to the clear)\n\nKill the boss using your bossing team for a 5-turn clear"
    },
    {
      "Name": "11-1",
      "Description": null
    },
    {
      "Name": "11-2",
      "Description": null
    },
    {
      "Name": "11-3",
      "Description": null
    },
    {
      "Name": "11-4",
      "Description": null
    },
    {
      "Name": "11-5",
      "Description": null
    },
    {
      "Name": "11-1H",
      "Description": "Bossing team left, Clearing team right\n\nAttack enemy to the left with your bossing team and move your clearing team left to where your bossing team was\n\nSwap places with your bossing team and attack the enemy above with your clearing team. Move your bossing team left.\n\nMove both teams one spot up\n\nGrab the present box with your clearing team and kill the boss for a 4-turn clear"
    },
    {
      "Name": "11-2H",
      "Description": "Bossing team left, Clearing team right\n\nMove both teams one spot up and don't use the teleporter\n\nAttack the enemy above with your bossing team and move your clearing team up\n\nMove your bossing team right and then move your clearing team to the spot right below it\n\nAttack the enemy to the right using your Clearing team and then move your bossing team to where your clearing team was before\n\nTrade places with your bossing team and attack the enemy above then kill the boss for a 5-turn clear"
    },
    {
      "Name": "11-3H",
      "Description": "Bossing team left, Clearing team right\n\nMove clearing team down and bossing team up. Use the teleporter.\n\nMove your clearing team to the right. Don't use the teleporter with your clearing team.\n\nMove your bossing team right and attack the enemy above you with your clearing team\n\nKill the boss for a 3-turn clear"
    },
    {
      "Name": "12-1",
      "Description": null
    },
    {
      "Name": "12-2",
      "Description": null
    },
    {
      "Name": "12-3",
      "Description": null
    },
    {
      "Name": "12-4",
      "Description": null
    },
    {
      "Name": "12-5",
      "Description": "Boss-killer team on left side, sweep team on right side (5 turns)\n\nMove bk team to (2) then teleport to the right side\n\nSwap with sweep team, move to tile (1) then teleport\n\nMove sweep team to tile (4), teleport back the bk team to left side (2)\n\nTeleport back sweep team to tile (1) bottom, clear enemy in front of boss team\n\nMove sweep team to the right of tile (3), move bk team to tile/yellow (4)\n\nClear remaining enemy on the right side using sweep team, clear boss using bk team"
    },
    {
      "Name": "12-1H",
      "Description": "Start: Bossing team Left, Clearing team Right.\n\nTurn 1: Move your Clearing team to the Teleporter (1) and Teleport. Bossing team swaps places with Clearing team and take the giftbox.\n\nTurn 2: Take the Teleporter (1) with your Clearing team again and teleport. Bossing team moves up.\n\nTurn 3: Clearing team moves to (2). Bossing team attacks the Enemy.\n\nTurn 4: Clearing team attacks the enemy below. Boss team moves up to the (2) and waits for the boss to attack during enemy turn, granting a 4-turn clear."
    },
    {
      "Name": "12-2H",
      "Description": "Start: Bossing team Left, Clearing team Right.\n\nTurn 1: Move your Bossing team one spot down then swap places with your Clearing team and attack the enemy to your diagonal right, next to (2).\n\nTurn 2: Move your Clearing team to (2), then move your Bossing team up.\n\nTurn 3: Grab the giftbox with your Clearing team and attack the enemy above you with your Bossing team\n\nTurn 4: Attack the boss with your Bossing team for a 4-turn clear. If your Clearing team gets wiped by the mystic enemy then, that won't affect your 3-star rating so don't worry about withdrawing when attacked by it."
    },
    {
      "Name": "12-3H",
      "Description": "Clearing team on top, Bossing team on bottom\n\nAttack the enemy in sight with your Clearing team then swap places with your Bossing team and use the teleporter\n\nGrab the giftbox then move to (4) with your Bossing team\n\nMove bossing team to (1) and move your Clearing team one spot down\n\nUse the teleporter with your Bossing team and move your Clearing team one spot to the left\n\nMove your Clearing team one spot below to (3) and attack the enemy to your left with your Bossing team\n\nAttack the enemy to your right with your Clearing team and kill the boss with your Bossing team for a 6-turn clear\n\n(Skip the giftbox and go directly to (4) on turn 2 for a 5-turn clear)"
    },
    {
      "Name": "13-1",
      "Description": null
    },
    {
      "Name": "13-2",
      "Description": null
    },
    {
      "Name": "13-3",
      "Description": "Boss-killer team on right, sweep team on left (4 turns)\n\nMove up both sweep team and bk team\n\nMove bk up, sweep team move right (sweep team will teleport to bk team start position)\n\nMove bk team to right, then clear enemy using sweep team\n\nKill boss using bk team"
    },
    {
      "Name": "13-4",
      "Description": null
    },
    {
      "Name": "13-5",
      "Description": null
    },
    {
      "Name": "13-1H",
      "Description": "Bossing Team on top, Clearing Team on bottom\n\nMove Clearing Team to the left and Bossing Team to the cracked cell on top\n\nMove Clearing Team to cracked cell on bottom and swap places with Bossing Team then attack the enemy directly below you\n\nMove Clearing Team to the right and Bossing Team to the left\n\nGrab the giftbox and then Kill the boss for a 4-turn clear"
    },
    {
      "Name": "13-2H",
      "Description": "Bossing team on top, Clearing team on the right\n\nMove Bossing Team to (1) and Clearing team to (2) respectively\n\nMove Clearing team left then swap positions with Bossing Team and attack the enemy directly to your left\n\nAttack the enemy to the right of Clearing team then kill the boss for a 3-turn clear"
    },
    {
      "Name": "13-3H",
      "Description": "Clearing team to the left, Bossing to the right\n\nAttack the middle enemy with your clearing team and move the bossing team to (1) on the map then swap with clearing team and advance to (2) with your bossing team\n\nAttack the tank below using the clearing team and move bossing team towards the boss\n\nGrab the present box using your clearing team and attack the boss for a 4-turn clear"
    },
    {
      "Name": "14-1",
      "Description": null
    },
    {
      "Name": "14-2",
      "Description": null
    },
    {
      "Name": "14-3",
      "Description": null
    },
    {
      "Name": "14-4",
      "Description": null
    },
    {
      "Name": "14-5",
      "Description": null
    },
    {
      "Name": "14-1H",
      "Description": "Clearing team below, Bossing team above.\n\nMove both teams to the right.\n\nMove bossing team to the right, attack enemy above with clearing.\n\nAttack enemy with bossing team, move clearing team above so it will go to the start above.\n\nMove clearing team to (1), then move bossing team to the new platform.\n\nGrab gift box and attack boss for a 5 turn clear."
    },
    {
      "Name": "14-2H",
      "Description": "Bossing team to the right, Clearing team to the left.\n\nAttack enemy below with bossing. Move clearing team above.\n\nMove bossing left first and swap with clearing team, attacking the enemy above.\n\nMove clearing to (1), move bossing left.\n\nGrab gift box and attack boss for a 4 turn clear."
    },
    {
      "Name": "14-3H",
      "Description": "* Clearing team left, Bossing team right\n* Clearing team down, Bossing team left\n* Clearing team down to activate space 1,  Bossing team left\n* Clearing team down, Bossing team swap with Clearing team then move left down to activate space 2\n* Clearing team up to engage enemy, Bossing team left to get gift  Boss will attack on their turn for a 4 turn clear"
    },
    {
      "Name": "15-1",
      "Description": null
    },
    {
      "Name": "15-2",
      "Description": null
    },
    {
      "Name": "15-3",
      "Description": null
    },
    {
      "Name": "15-4",
      "Description": null
    },
    {
      "Name": "15-5",
      "Description": null
    },
    {
      "Name": "15-1H",
      "Description": "* Bossing team right, clearing team left\n\n# Move bossing team right and teleport, clearing team up\n# Move both team up\n# Clearing team up, swap teams, move bossing team further up\n# After clearing team was thrown back to the start, grab item box. Move bossing team left, end of turn, for 4-turn clear."
    },
    {
      "Name": "15-2H",
      "Description": "* Clearing team left, Bossing team right\n* Clearing team left through 2, bossing team swap with clearing team then through 1\n* Clearing team right, bossing team up\n* Clearing team right, bossing team up\n* Clearing team grab gift, bossing team attack boss for a 4 turn clear."
    },
    {
      "Name": "15-3H",
      "Description": "Team A starts at top, Team B starts at middle, Team C (main team) starts at bottom\n\n\nTeam A takes teleporter (3). Team B moves right, defeats enemy. Team C takes teleporter (1).\n\nTeam B goes right. Team A swaps with B and goes right. Team C swaps with A and goes right.\n\nTeam A moves down onto cracked tile. Team B takes teleporter (3), and takes teleporter (2). Team C moves right, defeats enemy.\n\nTeam B moves right, defeats enemy. Team C moves down. Team A ends turn on cracked tile (no movement).\n\nTeam B moves up, defeats enemy. Team A moves down, collects gift. Team C defeats boss."
    },
    {
      "Name": "16-1",
      "Description": null
    },
    {
      "Name": "16-2",
      "Description": null
    },
    {
      "Name": "16-3",
      "Description": null
    },
    {
      "Name": "16-4",
      "Description": null
    },
    {
      "Name": "16-5",
      "Description": null
    },
    {
      "Name": "16-1H",
      "Description": "yellow team right (main), blue team top.\n\n\nTurn 1, yellow team goes left, blue team goes down.\n\nTurn 2, yellow team goes left, blue team goes down.\n\nTurn 3, yellow team goes down and attacks, blue team goes down.\n\nTurn 4, yellow team goes left, blue team goes right.\n\nTurn 5, yellow team goes up, blue team goes down to grabs gift."
    },
    {
      "Name": "16-2H",
      "Description": "blue team bottom, yellow team top (main).\n\n\nTurn 1, blue team goes up, yellow team goes left.\n\nTurn 2, blue team goes up and attacks, yellow team swap with blue team and goes left.\n\nTurn 3, yellow team goes down and attack, blue team goes down.\n\nTurn 4, blue team goes down to grabs gift, yellow team attack boss."
    },
    {
      "Name": "16-3H",
      "Description": "Team A (yellow) top left, Team B (blue) down left, Team C (yellow) right (main).\n\n\nTurn 1, Team A goes right, Team B goes up, Team C goes left.\n\nTurn 2, Team B goes up-right and attacks, Team A swaps with Team B, goes right and attacks, Team C goes up-left to cracked tile.\n\nTurn 3, Team A goes down and grabs gift, Team B goes down and attacks, Team C swaps with Team A and goes down to attack.\n\nTurn 4, Team A goes up-right and attacks, Team C goes down and attacks boss."
    },
    {
      "Name": "17-1",
      "Description": null
    },
    {
      "Name": "17-2",
      "Description": null
    },
    {
      "Name": "17-3",
      "Description": null
    },
    {
      "Name": "17-4",
      "Description": null
    },
    {
      "Name": "17-5",
      "Description": null
    },
    {
      "Name": "17-1H",
      "Description": "Yellow team (clearing) on the right, red team (bossing) on the left.\n\nTurn 1: Clearing team goes down and attacks. Bossing team goes down and attacks.\n\nTurn 2: Clearing team goes down-right. Bossing team goes to the drone thing.\n\nTurn 3: Clearing team goes down-right again. Bossing team goes down-left.\n\nTurn 4: Clearing team takes the gift box. Bossing team goes down-left again. The rest of the enemies should attack both teams."
    },
    {
      "Name": "17-2H",
      "Description": "Yellow team (clearing) on the right, red team (bossing) on the left.\n\nTurn 1: Clearing team goes down-left. Bossing team goes down-left and attacks.\n\nTurn 2: Clearing team goes down-left. Bossing team goes down-left, taking a buff.\n\nTurn 3: Bossing team goes down-right. Clearing team swaps place with bossing and goes down-left.\n\nTurn 4: Clearing team goes down-right. Bossing team goes right.\n\nTurn 5: Clearing team goes down-right, taking the gift box. Bossing team goes down-right, then be attacked by the boss."
    },
    {
      "Name": "17-3H",
      "Description": "Red team (bossing) on the left, yellow team (clearing 1) in the middle, and another red team (clearing 2) on the right.\n\nTurn 1: Clearing 1 goes top-left. Clearing 2 goes top-left. Bossing goes top-left.\n\nTurn 2: Clearing 1 goes top-left. Clearing 2 goes top-right. Bossing goes top-right to the drone.\n\nTurn 3: Clearing 1 goes top-left and attacks. Clearing 2 goes top-left. Bossing swaps with clearing 1 then goes top-left and attacks.\n\nTurn 4: Clearing 1 goes bottom-left. Bossing goes to top-right and as a result, clearing 2 will be returned to rightmost starting point. Clearing 2 then goes top-left, returning clearing 1 to leftmost starting point.\n\nTurn 5: Clearing 1 goes bottom-left and take the gift box. Clearing 2 goes left and attacks. Bossing goes top-left into boss, ending the mission with (hopefully) all the objectives accomplished."
    },
    {
      "Name": "18-1",
      "Description": null
    },
    {
      "Name": "18-2",
      "Description": null
    },
    {
      "Name": "18-3",
      "Description": null
    },
    {
      "Name": "18-4",
      "Description": null
    },
    {
      "Name": "18-5",
      "Description": null
    },
    {
      "Name": "18-1H",
      "Description": "Team A (Red) on the left and Team B (Blue, Boss) right\n\nTurn 1: Team B goes bottom-left and attacks. Team A goes bottom-right and attack.\n\nTurn 2: Team B goes bottom-right. Team A goes bottom-right.\n\nTurn 3: Team B goes bottom-right. Team A goes bottom-right and uses teleporter.\n\nTurn 4: Team A goes right. Team B goes bottom-right.\n\nTurn 5: Team A goes right and takes gift box. Team B goes right and attacks boss."
    },
    {
      "Name": "18-2H",
      "Description": "Team A (Red) on the left and Team B (Blue, Boss) right\n\nTurn 1: Team B goes left and teleports. Team A goes bottom-right and attacks.\n\nTurn 2: Team B goes bottom-right. Team A goes bottom-right and teleports.\n\nTurn 3: Team B goes bottom-right and does not teleport. Team A goes top-left.\n\nTurn 4: Team A goes top-left. Team B teleports and goes right.\n\nTurn 5: Team A goes top-left and takes gift box. Team B goes right and attacks boss."
    },
    {
      "Name": "18-3H",
      "Description": "Team A (Blue) on the left, Team B (Blue, Boss) middle, Team C (Red) on the right.\n\nTurn 1: Team A goes left and attacks. Team B goes bottom and attacks. Team C goes left and attacks.\n\nTurn 2: Team A goes bottom to the drone. Team B goes right. Team C goes left\n\nTurn 3: Team A goes bottom. Team C goes left don't takes teleporter. Team B goes right swaps with Team C takes teleporter goes right and attacks.\n\nTurn 4: Team C goes bottom. Team A goes bottom. Team B goes right.\n\nTurn 5: Team C goes bottom and take the gift box. Team B goes right and attacks boss."
    },
    {
      "Name": "19-1",
      "Description": null
    },
    {
      "Name": "19-2",
      "Description": null
    },
    {
      "Name": "19-3",
      "Description": null
    },
    {
      "Name": "19-4",
      "Description": null
    },
    {
      "Name": "19-5",
      "Description": null
    },
    {
      "Name": "19-1H",
      "Description": "Team A (Blue) on the Top-left,Team B (Yellow,Boss) right\n\nTurn 1:Team A goes top and attacks. Team B goes left.\n\nTurn 2:Team A goes bottom. Team B goes left to the drone.\n\nTurn 3:Team B goes top. Team A goes top=right.\n\nTurn 4:Team A goes right. Team B goes bottom-left\n\nTurn 5:Team A goes bottom and take the gift box. Team B goes bottom and attacks boss."
    },
    {
      "Name": "19-2H",
      "Description": "Team A (Blue) on the left,Team B (Yellow,Boss) right\n\nTurn 1:Team B goes top-left and attack. Team A goes bottom-right and attack.\n\nTurn 2:Team B goes top to the drone. Team A goes right.\n\nTurn 3:Team B swaps with Team A and goes top-right. Team A goes left.\n\nTurn 4:Team A goes bottom. Team B goes left.\n\nTurn 5:Team A goes bottom-right and take gift box. Team B goes left and attack boss."
    },
    {
      "Name": "19-3H",
      "Description": "Team A (Yellow) on the top, Team B (Blue) middle, Team C (Yellow, Boss) on the bottom\n\nTurn 1: Team A goes right. Team B goes top. Team C goes top.\n\nTurn 2: Team A goes bottom. Team B goes right. Team C goes top.\n\nTurn 3: Team A swaps with Team B and goes right. Team B goes left. Team C goes top and attack. \n\nTurn 4: Team B goes left and attack. Team A goes top and attack. Team C goes top to the drone.\n\nTurn 5: Team B goes top and take the gift box. Team A goes right. Team C swaps with Team A and attack Boss."
    },
    {
      "Name": "20-1",
      "Description": null
    },
    {
      "Name": "20-2",
      "Description": null
    },
    {
      "Name": "20-3",
      "Description": null
    },
    {
      "Name": "20-4",
      "Description": null
    },
    {
      "Name": "20-5",
      "Description": null
    },
    {
      "Name": "20-1H",
      "Description": "Team A (Red, Boss) on the left and Team B (Yellow) right\n\nTurn 1: Team B goes top-right. Team A goes bottom-right.\n\nTurn 2: Team B goes top-right. Team A goes right.\n\nTurn 3: Team B doesn't move. Team A goes top-right.\n\nTurn 4: Team A goes top-left. Team B goes left.\n\nTurn 5: Team B goes top-left and takes gift box. Team A goes top-left and attacks boss."
    },
    {
      "Name": "20-2H",
      "Description": "Team A (Red, Boss) on the left, Team B (Yellow) on the right.\n\nTurn 1: Team A goes right. Team B goes bottom.\n\nTurn 2: Team A goes right. Team B goes bottom-left.\n\nTurn 3: Team B goes left. Team A swaps with Team B and goes top.\n\nTurn 4: Team B goes bottom. Team A goes top and attack. \n\nTurn 5: Team B goes bottom-left and takes the gift box. Team A top and attack Boss."
    },
    {
      "Name": "20-3H",
      "Description": "Team A (Red) on the bottom-left, Team B (Red, Boss) bottom-right, Team C (Yellow) top.\n\nTurn 1: Team A goes top-left. Team B goes top-left. Team C goes right.\n\nTurn 2: Team A goes top-left. Team B goes top-right. Team C goes right.\n\nTurn 3: Team A goes left. Team C goes right. Team B swaps with team C and goes right.\n\nTurn 4: Team A goes top-left. Team B goes bottom-right. Team C goes bottom-left.\n\nTurn 5: Team A goes top-left. Team C goes bottom-right and grabs gift. Team B goes bottom-left and attacks boss."
    },
    {
      "Name": "21-1",
      "Description": null
    },
    {
      "Name": "21-2",
      "Description": null
    },
    {
      "Name": "21-3",
      "Description": null
    },
    {
      "Name": "21-4",
      "Description": null
    },
    {
      "Name": "21-5",
      "Description": null
    },
    {
      "Name": "21-1H",
      "Description": null
    },
    {
      "Name": "21-2H",
      "Description": null
    },
    {
      "Name": "21-3H",
      "Description": null
    },
    {
      "Name": "3-A",
      "Description": null
    },
    {
      "Name": "6-A",
      "Description": null
    },
    {
      "Name": "9-A",
      "Description": null
    },
    {
      "Name": "12-A",
      "Description": null
    },
    {
      "Name": "15-A",
      "Description": null
    },
    {
      "Name": "18-A",
      "Description": null
    },
    {
      "Name": "21-A",
      "Description": null
    },
    {
      "Name": "22-1",
      "Description": null
    },
    {
      "Name": "22-2",
      "Description": null
    },
    {
      "Name": "22-3",
      "Description": null
    },
    {
      "Name": "22-4",
      "Description": null
    },
    {
      "Name": "22-5",
      "Description": null
    },
    {
      "Name": "22-1H",
      "Description": null
    },
    {
      "Name": "22-2H",
      "Description": null
    },
    {
      "Name": "22-3H",
      "Description": null
    },
    {
      "Name": "23-1",
      "Description": null
    },
    {
      "Name": "23-2",
      "Description": null
    },
    {
      "Name": "23-3",
      "Description": null
    },
    {
      "Name": "23-4",
      "Description": null
    },
    {
      "Name": "23-5",
      "Description": null
    },
    {
      "Name": "23-1H",
      "Description": null
    },
    {
      "Name": "23-2H",
      "Description": null
    },
    {
      "Name": "23-3H",
      "Description": null
    }
  ]
}